Revit 2027 API
PropertyLine.IsValidBoundary Method
 Identifies whether the given curve loops compose a valid boundary to create PropertyLine element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidBoundary(
	IList<CurveLoop> curveLoops
)
Public Shared Function IsValidBoundary (
	curveLoops As IList(Of CurveLoop)
) As Boolean
public:
static bool IsValidBoundary(
	IList<CurveLoop^>^ curveLoops
)
static member IsValidBoundary :
        curveLoops : IList<CurveLoop> -> bool
Parameters
curveLoops IList<CurveLoop>
 The curve loops to be checked.
Return Value
Boolean
 True if the given curve loops don't intersect with each other; and each loop is planar and lies on a plane parallel to the horizontal(XY) plane. Any requirement above is not satisfied or no curve loops contained, returns false.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The curve loops is not necessary to close, it could be open, but should not intersect with each other; and each loop is planar and lies on a plane parallel to the horizontal(XY) plane. Also, the curves should not contain any unbounded circle/ellipse.
See Also
Reference
PropertyLine Class
Autodesk.Revit.DB Namespace